app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'joselinee076@gmail.com'
 LIMIT 1
---
    public function findByEmail($email)
    {
        return $this->where('email', $email)->first();

SELECT *
FROM `user`
WHERE `reset_hash` = 'f7a3689a17aa2d9eaa6899b816fa5e8fd5df0494153ff0518db5dc676f60d05b'
 LIMIT 1
---
    public function getUserForPasswordReset($token)
    {
        $token = new Token($token);
        $token_hash = $token->getHash();

        $user = $this->where('reset_hash', $token_hash)->first();